//
//  ConstantsIndex.swift
//  Compound 2
//
//  Created by Robert Zakiev on 02.01.2020.
//  Copyright © 2020 Robert Zakiev. All rights reserved.
//

import Foundation

struct ConstantsIndex {
    
    @available(*, unavailable)
    private init() {}
    
    //MARK: - Moscow Exchange Index
    static let weightedCompaniesOfMOEX: [(name: String, weight: Double)] = [
        ("АФК Система", 0.41),
        ("Аэрофлот", 0.4),
        ("Алроса", 1.79),
        ("МКБ", 0.3),
        ("Северсталь", 1.33),
        ("Детский Мир", 0.21),
        ("ФСК ЕЭС", 0.39),
        ("X5 Retail Group", 2.02),
        ("Газпром", 14.37),
        ("Норильский Никель", 6.57),
        ("Русгидро", 0.38),
        ("ИнтерРао", 1.47),
        ("Лукойл", 13.63),
        ("Лента", 0.17),
        ("Группа ЛСР", 0.28),
        ("ММК", 0.64),
        ("Магнит", 2.1),
        ("Московская Биржа", 1.21),
        ("МТС", 2.44),
        ("НЛМК", 1.39),
        ("Новатэк", 4.61),
        ("Фосагро", 0.66),
        ("Группа Пик", 0.4),
        ("Полюс Золото", 1.69),
        ("Полиметалл", 1.74),
        ("Роснефть", 4.45),
        ("Ростелеком", 0.55),
        ("Русал", 0.63),
        ("Сбербанк", 14.45),
        ("Сбербанк-п", 1.25),
        ("Сургутнефтегаз", 3.49),
        ("Сургутнефтегаз-п", 1.64),
        ("Татнефть", 3.96),
        ("Татнефть-п", 0.81),
        ("Tinkoff", 1.18),
        ("Транснефть-п", 0.75),
        ("Юнипро", 0.24),
        ("ВТБ", 1.36),
        ("Яндекс", 4.63)
    ]
    
    //MARK: - Moscow Exchange Enhanced Index
    static let enhancedMOEX: [(name: String, weight: Double)] = [
        ("АФК Система", 0.41),
        ("Аэрофлот", 0.4),
        ("Алроса", 1.79),
        ("МКБ", 0.3),
        ("Северсталь", 1.33),
        ("Детский Мир", 0.21),
        ("ФСК ЕЭС", 0.39),
        ("X5 Retail Group", 2.02),
        ("Газпром", 14.37),
        ("Норильский Никель", 6.57),
        ("Русгидро", 0.38),
        ("ИнтерРао", 1.47),
        ("Лукойл", 13.63),
        ("Лента", 0.17),
        ("Группа ЛСР", 0.28),
        ("ММК", 0.64),
        ("Магнит", 2.1),
        ("Московская Биржа", 1.21),
        ("МТС", 3.19),
        ("НЛМК", 1.39),
        ("Новатэк", 4.61),
        ("Фосагро", 0.66),
        ("Группа Пик", 0.4),
        ("Полюс Золото", 1.69),
        ("Полиметалл", 1.74),
        ("Роснефть", 4.45),
        ("Ростелеком", 0.55),
        ("Русал", 0.63),
        ("Сбербанк", 14.45),
        ("Сбербанк-п", 1.25),
        ("Сургутнефтегаз", 3.49),
        ("Сургутнефтегаз-п", 1.64),
        ("Татнефть", 3.96),
        ("Татнефть-п", 0.81),
        ("Tinkoff", 1.18),
        ("Юнипро", 0.24),
        ("ВТБ", 1.36),
        ("Яндекс", 4.63)
    ]
}
